Repository: NnAsankaMadushan/Lotto-Vision-Mobile-App
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appName
source: LottoVision
si: ලොටෝ විෂන්
ta: லோட்டோ விஷன்

source: Home
si: මුල් පිටුව
ta: முகப்பு

# scan
source: Scan Ticket
si: ටිකට් පතය ස්කෑන් කරන්න
ta: டிக்கெட்டை ஸ்கேன் செய்

source: History
si: ඉතිහාසය
ta: வரலாறு

source: Results
si: ප්‍රතිඵල
ta: முடிவுகள்

source: Settings
si: සැකසුම්
ta: அமைப்புகள்

source: Notifications
si: නිවේදන
ta: அறிவிப்புகள்

# scanTicket
source: Scan Lottery Ticket
si: ලොතරැයි ටිකට් පත ස්කෑන් කරන්න
ta: லாட்டரி டிக்கெட்டை ஸ்கேன் செய்

source: Take Photo
si: ඡායාරූපයක් ගන්න
ta: புகைப்படம் எடுக்க

source: Choose from Gallery
si: ගැලරියෙන් තෝරන්න
ta: கேலரியிலிருந்து தேர்வு செய்

source: Scanning...
si: ස්කෑන් කරමින්...
ta: ஸ்கேன் செய்கிறது...

source: Processing...
si: සකසමින්...
ta: செயலாக்குகிறது...

source: Checking Results...
si: ප්‍රතිඵල පරීක්ෂා කරමින්...
ta: முடிவுகளை சரிபார்க்கிறது...

source: Winner!
si: ජයග්‍රාහකයා!
ta: வெற்றியாளர்!

# notWinner
source: Not a Winner
si: ජයග්‍රාහකයෙක් නොවේ
ta: வெற்றியாளர் இல்லை

source: Congratulations!
si: සුබ පැතුම්!
ta: வாழ்த்துக்கள்!

# youWon
source: You won LKR {amount}
si: ඔබ රු. {amount} ක් දිනා ඇත
ta: நீங்கள் ரூ. {amount} வென்றீர்கள்

# matchedNumbers
source: Matched {count} numbers
si: අංක {count} ක් ගැලපේ
ta: {count} எண்கள் பொருந்தின

source: Draw #{number}
si: දිනුම් අංකය #{number}
ta: டிராவ் #{number}

# drawDate
source: Draw Date: {date}
si: දිනුම් දිනය: {date}
ta: டிராவ் தேதி: {date}

source: Ticket Details
si: ටිකට් පත් විස්තර
ta: டிக்கெட் விவரங்கள்

source: Winning Numbers
si: ජයග්‍රාහී අංක
ta: வெற்றி எண்கள்

source: Your Numbers
si: ඔබේ අංක
ta: உங்கள் எண்கள்

source: Lottery Type
si: ලොතරැයි වර්ගය
ta: லாட்டரி வகை

source: Serial Number
si: අනුක්‍රමික අංකය
ta: வரிசை எண்

source: Check Ticket
si: ටිකට් පත පරීක්ෂා කරන්න
ta: டிக்கெட்டை சரிபார்

source: Delete Ticket
si: ටිකට් පත මකන්න
ta: டிக்கெட்டை அழி

# noTickets
source: No tickets scanned yet
si: තවම ටිකට් පත් ස්කෑන් කර නැත
ta: இன்னும் டிக்கெட்டுகள் ஸ்கேன் செய்யப்படவில்லை

# noResults
source: No results available
si: ප්‍රතිඵල නොමැත
ta: முடிவுகள் இல்லை

source: Error
si: දෝෂයකි
ta: பிழை

source: Try Again
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சி செய்

source: Cancel
si: අවලංගු කරන්න
ta: ரத்து செய்

source: OK
si: හරි
ta: சரி

source: Retry
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சி செய்

source: Language
si: භාෂාව
ta: மொழி

source: Theme
si: තේමාව
ta: தீம்

source: Light Mode
si: ආලෝක ප්‍රකාරය
ta: ஒளி பயன்முறை

source: Dark Mode
si: අඳුරු ප්‍රකාරය
ta: இருள் பயன்முறை

source: System Default
si: පද්ධති පෙරනිමිය
ta: கணினி இயல்புநிலை

source: About
si: පිළිබඳව
ta: பற்றி

source: Version
si: අනුවාදය
ta: பதிப்பு

# cameraPermissionDenied
source: Camera permission is required to scan tickets
si: ටිකට් පත් ස්කෑන් කිරීමට කැමරා අවසරය අවශ්‍යයි
ta: டிக்கெட்டுகளை ஸ்கேன் செய்ய கேமரா அனுமதி தேவை

# storagePermissionDenied
source: Storage permission is required
si: ගබඩා අවසරය අවශ්‍යයි
ta: சேமிப்பக அனுமதி தேவை

source: Grant Permission
si: අවසරය ලබා දෙන්න
ta: அனுமதி வழங்கு

# imageQualityLow
source: Image quality too low. Please retake the photo
si: රූප ගුණාත්මකභාවය ඉතා අඩුයි. කරුණාකර නැවත ඡායාරූපය ගන්න
ta: படத்தின் தரம் மிகக் குறைவு. தயவுசெய்து புகைப்படத்தை மீண்டும் எடுக்கவும்

# noTextDetected
source: No text detected in the image
si: රූපයෙන් පෙළ හඳුනා නොගත්
ta: படத்தில் உரை கண்டறியப்படவில்லை

# invalidTicket
source: Invalid lottery ticket
si: වලංගු නොවන ලොතරැයි ටිකට් පතක්
ta: தவறான லாட்டரி டிக்கெட்

source: Could not detect lottery type
si: ලොතරැයි වර්ගය හඳුනාගත නොහැක
ta: லாட்டரி வகையைக் கண்டறிய முடியவில்லை

# fetchingResults
source: Fetching latest results...
si: නවතම ප්‍රතිඵල ලබා ගනිමින්...
ta: சமீபத்திய முடிவுகளைப் பெறுகிறது...

# resultNotFound
source: Results not found for this draw
si: මෙම දිනුම සඳහා ප්‍රතිඵල හමු නොවීය
ta: இந்த டிராவுக்கான முடிவுகள் கிடைக்கவில்லை

source: No internet connection
si: අන්තර්ජාල සම්බන්ධතාවයක් නැත
ta: இணைய இணைப்பு இல்லை

# lotteryAdaSampatha
source: Ada Sampatha
si: අද සම්පත

# lotteryDaruDiriSampatha
source: Daru Diri Sampatha
si: දරු දිරි සම්පත

# lotteryDelakshapathi
source: Delakshapathi Double Dreams
si: දෙලක්ෂපති ද්විත්ව ස්වප්න

# lotteryDhanaNidhanaya
source: Dhana Nidhanaya
si: ධන නිධානය

# lotteryDollarFortune
source: Dollar Fortune
si: ඩොලර් සම්පත

# lotteryGovisetha
source: Govisetha
si: ගෝවිසේත

# lotteryHandahana
source: Handahana
si: හන්දහන

# lotteryJathika
source: Jathika Sampatha
si: ජාතික සම්පත

# lotteryMahajana
source: Mahajana Sampatha
si: මහජන සම්පත

# lotteryMega60
source: Mega 60
si: මෙගා 60

# lotteryMegaMillions
source: Mega Millions
si: මෙගා මිලියන

# lotteryMegaPower
source: Mega Power
si: මෙගා පවර්

# lotteryNeeroga
source: Neeroga Lagna Jaya
si: නීරෝග ලග්න ජය

# lotteryNlbJaya
source: NLB Jaya
si: එන්.එල්.බී ජය

# lotterySampathRekha
source: Sampath Rekha
si: සම්පත් රේඛා

# lotterySampathaLagnaVarama
source: Sampatha Lagna Varama
si: සම්පත ලග්න වරම

# lotterySevana
source: Sevana
si: සේවන

# lotteryShanida
source: Shanida
si: ශනිද

# lotterySubaDawasak
source: Suba Dawasak
si: සුබ දවසක්

# lotterySuperFifty
source: Vasana Super Fifty
si: වසන සුපර් පණ්ඩෑස්

# lotterySupiriVasana
source: Supiri Vasana
si: සුපිරි වසන

# lotteryVasana
source: Vasana Sampatha
si: වසන සම්පත

# lotteryUnknown
source: Unknown
si: නොදනී

source: Prediction
si: අනාවැකි
ta: கணிப்பு

source: Quick Actions
si: වේගවත් ක්‍රියා
ta: விரைவு செயல்கள்

# scanningTicketSection
source: Scanning Ticket
si: ටිකට් පත ස්කෑන් කිරීම
ta: டிக்கெட் ஸ்கேன்

source: Choose an option
si: විකල්පයක් තෝරන්න
ta: ஒரு விருப்பத்தைத் தேர்வுசெய்க

source: Processing image...
si: රූපය සකසමින්...
ta: படம் செயலாக்கப்படுகிறது...

# cameraPermissionRequired
source: Camera permission is required
si: කැමරා අවසරය අවශ්‍යයි
ta: கேமரா அனுமதி தேவை

# galleryPermissionRequired
source: Gallery permission is required
si: ගැලරිය අවසරය අවශ්‍යයි
ta: கேலரி அனுமதி தேவை

# errorWithMessage
source: Error: {message}
si: දෝෂය: {message}
ta: பிழை: {message}

# scanningTicketProgress
source: Scanning ticket...
si: ටිකට් පත ස්කෑන් කරමින්...
ta: டிக்கெட் ஸ்கேன் செய்கிறது...

source: Extracting lottery information
si: ලොතරැයි තොරතුරු උපුටා ගනිමින්
ta: லாட்டரி தகவல் எடுக்கப்படுகிறது

source: Check Results
si: ප්‍රතිඵල පරීක්ෂා කරන්න
ta: முடிவுகளைச் சரிபார்

# checkingResultsProgress
source: Checking results...
si: ප්‍රතිඵල පරීක්ෂා කරමින්...
ta: முடிவுகள் சரிபார்க்கப்படுகின்றன...

source: Better Luck Next Time
si: ඊළඟ වතාවේ වාසනාවන්ත වෙන්න
ta: அடுத்த முறை நல்ல அதிர்ஷ்டம்

# noneMatchedForDraw
source: None of your numbers matched the winning numbers for this draw.
si: මෙම දිනුම සඳහා ඔබගේ කිසිදු අංකයක් ජයග්‍රාහී අංක සමඟ ගැලපුණේ නැත.
ta: இந்த டிராவிற்கு உங்கள் எண்களில் எதுவும் வெற்றி எண்களுடன் பொருந்தவில்லை.

source: Winning Results
si: ජයග්‍රාහී ප්‍රතිඵල
ta: வெற்றி முடிவுகள்

source: Lottery
si: ලොතරැයි
ta: லாட்டரி

source: Lucky Letter
si: වාසනා අකුර
ta: அதிர்ஷ்ட எழுத்து

source: Lucky Letter: {value}
si: වාසනා අකුර: {value}
ta: அதிர்ஷ்ட எழுத்து: {value}

source: Serial
si: අනුක්‍රමික අංකය
ta: வரிசை

source: Check Failed
si: පරීක්ෂාව අසාර්ථකයි
ta: சரிபார்ப்பு தோல்வி

source: Failed to load results
si: ප්‍රතිඵල පූරණය කළ නොහැකි විය
ta: முடிவுகளை ஏற்ற முடியவில்லை

source: Pull to refresh or try again later
si: නවීකරණයට පහළට ඇද නැවත උත්සාහ කරන්න හෝ පසුව උත්සාහ කරන්න
ta: புதுப்பிக்க கீழே இழுக்கவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்

source: Re-check
si: නැවත පරීක්ෂා කරන්න
ta: மீண்டும் சரிபார்

source: Take Another Photo
si: තවත් ඡායාරූපයක් ගන්න
ta: மற்றொரு புகைப்படம் எடுக்க

source: Reload
si: නැවත පූරණය කරන්න
ta: மீண்டும் ஏற்று

# sinhalaLanguageName
source: Sinhala
si: සිංහල
ta: සිංහල

# tamilLanguageName
source: Tamil
si: தமிழ்
ta: தமிழ்

source: Privacy Policy
si: රහස්‍යතා ප්‍රතිපත්තිය
ta: தனியுரிமைக் கொள்கை

source: Terms of Service
si: සේවා කොන්දේසි
ta: சேவை விதிமுறைகள்

# aboutDescription
source: Sri Lankan Lottery Ticket Scanner & Result Checker
si: ශ්‍රී ලාංකීය ලොතරැයි ටිකට් ස්කෑනර් සහ ප්‍රතිඵල පරීක්ෂක
ta: இலங்கை லாட்டரி டிக்கெட் ஸ்கேனர் மற்றும் முடிவு சரிபார்ப்பான்

# aboutCopyright
source: Copyright (c) 2024-2026 LottoVision. Licensed under MIT.
si: ප්‍රකාශන හිමිකම (c) 2024-2026 LottoVision. MIT යටතේ බලපත්‍ර ලබා ඇත.
ta: பதிப்புரிமை (c) 2024-2026 LottoVision. MIT உரிமத்தில் வழங்கப்படுகிறது.

source: View Licenses
si: බලපත්‍ර බලන්න
ta: உரிமங்கள் பார்க்க

source: Licenses
si: බලපත්‍ර
ta: உரிமங்கள்

source: Mark all read
si: සියල්ල කියවූ ලෙස සලකුණු කරන්න
ta: அனைத்தையும் வாசித்ததாக குறிக்க

source: No notifications yet
si: තවම නිවේදන නොමැත
ta: இன்னும் அறிவிப்புகள் இல்லை

# notificationsHint
source: You will receive notifications about lottery results here.
si: ලොතරැයි ප්‍රතිඵල පිළිබඳ නිවේදන ඔබට මෙහි ලැබේ.
ta: லாட்டரி முடிவுகள் குறித்த அறிவிப்புகள் இங்கே கிடைக்கும்.

source: Web Results
si: වෙබ් ප්‍රතිඵල
ta: இணைய முடிவுகள்

source: My Tickets
si: මගේ ටිකට්
ta: என் டிக்கெட்டுகள்

source: Website draw history
si: වෙබ් අඩවි දිනුම් ඉතිහාසය
ta: இணைய டிரா வரலாறு

source: Sync last 100 draws
si: අවසන් දිනුම් 100 සමමුහුර්ත කරන්න
ta: கடைசி 100 டிராவை ஒத்திசை

source: Syncing...
si: සමමුහුර්ත කරමින්...
ta: ஒத்திசைக்கிறது...

source: Syncing history...
si: ඉතිහාසය සමමුහුර්ත කරමින්...
ta: வரலாறு ஒத்திசைக்கிறது...

source: Sync now
si: දැන් සමමුහුර්ත කරන්න
ta: இப்போது ஒத்திசை

source: Source
si: මූලාශ්‍රය
ta: மூலம்

# historySyncReport
source: Synced {saved}/{requested} from {source}
si: {source} වෙතින් {saved}/{requested} සමමුහුර්ත කරන ලදී
ta: {source} இலிருந்து {saved}/{requested} ஒத்திசைக்கப்பட்டது

# historySyncFailed
source: History sync failed: {error}
si: ඉතිහාස සමමුහුර්ත කිරීම අසාර්ථකයි: {error}
ta: வரலாறு ஒத்திசைப்பு தோல்வி: {error}

source: Failed to load history
si: ඉතිහාසය පූරණය කළ නොහැකි විය
ta: வரலாற்றை ஏற்ற முடியவில்லை

source: No draw history yet
si: තවම දිනුම් ඉතිහාසයක් නොමැත
ta: இன்னும் டிரா வரலாறு இல்லை

# tapSyncLast100Draws
source: Tap "Sync last 100 draws" to pull from website.
si: වෙබ් අඩවියෙන් ලබා ගැනීමට "අවසන් දිනුම් 100 සමමුහුර්ත කරන්න" තට්ටු කරන්න.
ta: இணையதளத்திலிருந்து பெற "கடைசி 100 டிராவை ஒத்திசை" என்பதைத் தட்டவும்.

source: Prediction settings
si: අනාවැකි සැකසුම්
ta: கணிப்பு அமைப்புகள்

source: Number of sets
si: කට්ටල ගණන
ta: செட்களின் எண்ணிக்கை

source: History depth
si: ඉතිහාස පරාසය
ta: வரலாறு ஆழம்

# nSets
source: {count} sets
si: කට්ටල {count}
ta: {count} செட்கள்

# lastN
source: Last {count}
si: අවසන් {count}
ta: கடைசி {count}

source: Regenerate
si: නැවත උත්පාදනය කරන්න
ta: மீண்டும் உருவாக்கு

# noPastResultsFound
source: No past results found. Sync history to generate predictions.
si: පසුගිය ප්‍රතිඵල හමු නොවීය. අනාවැකි ජනනය කිරීමට ඉතිහාසය සමමුහුර්ත කරන්න.
ta: கடந்த முடிவுகள் இல்லை. கணிப்புகளை உருவாக்க வரலாற்றை ஒத்திசைக்கவும்.

source: Predicted letter / zodiac
si: අනාවැකි වාසනා අකුර / රාශිය
ta: கணிக்கப்பட்ட எழுத்து / ராசி

# alternatives
source: Alternatives: {items}
si: විකල්ප: {items}
ta: மாற்றுகள்: {items}

# moreCount
source: +{count} more
si: තවත් +{count}
ta: +{count} மேலும்

# basedOnCachedDraws
source: Based on {count} cached draws ({dateRange}).
si: කැෂ් කළ දිනුම් {count} මත පදනම්ව ({dateRange}).
ta: கேஷ் செய்யப்பட்ட {count} டிராக்களை அடிப்படையாகக் கொண்டு ({dateRange}).

source: Set {number}
si: කට්ටලය {number}
ta: செட் {number}

# scorePercent
source: Score {score}%
si: ලකුණු {score}%
ta: மதிப்பெண் {score}%

source: Number trends
si: අංක ප්‍රවණතා
ta: எண் போக்குகள்

source: Hot numbers
si: උණුසුම් අංක
ta: ஹாட் எண்கள்

source: Cold numbers
si: ශීත අංක
ta: கோல்ட் எண்கள்

source: Prediction failed
si: අනාවැකිය අසාර්ථකයි
ta: கணிப்பு தோல்வி

# noHistoryRange
source: no history
si: ඉතිහාසය නැත
ta: வரலாறு இல்லை

# quickActionResultsSubtitle
source: Check latest draw results
si: නවතම දිනුම් ප්‍රතිඵල පරීක්ෂා කරන්න
ta: சமீபத்திய டிரா முடிவுகளை பார்க்கவும்

# quickActionHistorySubtitle
source: Review scanned tickets
si: ස්කෑන් කළ ටිකට් සමාලෝචනය කරන්න
ta: ஸ்கேன் செய்யப்பட்ட டிக்கெட்டுகளைப் பார்வையிடவும்

# quickActionPredictionSubtitle
source: View smart number insights
si: බුද්ධිමත් අංක අවබෝධ බලන්න
ta: புத்திசாலி எண் தகவல்களைப் பார்க்கவும்

source: Smart Ticket Scanner
si: බුද්ධිමත් ටිකට් ස්කෑනර්
ta: ஸ்மார்ட் டிக்கெட் ஸ்கேனர்

# scanResultsVerifiedInSeconds
source: {takePhotoLabel}. Results are verified in seconds.
si: {takePhotoLabel}. ප්‍රතිඵල තත්පර කිහිපයකින් සත්‍යාපනය වේ.
ta: {takePhotoLabel}. சில விநாடிகளில் முடிவுகள் சரிபார்க்கப்படும்.

source: How it works
si: මෙය ක්‍රියා කරන ආකාරය
ta: இது எப்படி செயல்படுகிறது

# howItWorksStep1
source: Take a clear photo of your lottery ticket
si: ඔබගේ ලොතරැයි ටිකට් පතේ පැහැදිලි ඡායාරූපයක් ගන්න
ta: உங்கள் லாட்டரி டிக்கெட்டின் தெளிவான புகைப்படம் எடுக்கவும்

# howItWorksStep2
source: We extract the numbers using OCR technology
si: අපි OCR තාක්ෂණයෙන් අංක උපුටා ගනිමු
ta: OCR தொழில்நுட்பத்தை பயன்படுத்தி எண்களை எடுக்கிறோம்

# howItWorksStep3
source: Check against official results
si: නිල ප්‍රතිඵල සමඟ සැසඳෙන්න
ta: அதிகாரப்பூர்வ முடிவுகளுடன் ஒப்பிடவும்

# howItWorksStep4
source: Get instant winning notifications
si: ක්ෂණික ජයග්‍රාහී නිවේදන ලබාගන්න
ta: உடனடி வெற்றி அறிவிப்புகளைப் பெறவும்

# signLabel
source: SIGN
si: ලග්න
ta: ராசி

# seedResultTitle
source: Mahajana results are ready
si: මහජන ප්‍රතිඵල සූදානම්
ta: Mahajana முடிவுகள் தயாராக உள்ளன

# seedResultMessage
source: Draw #2345 is available. Check your ticket now.
si: දිනුම #2345 ලಭ್ಯයි. දැන් ඔබගේ ටිකට් පත පරීක්ෂා කරන්න.
ta: Draw #2345 கிடைக்கிறது. இப்போது உங்கள் டிக்கெட்டைச் சரிபார்க்கவும்.

# seedWinTitle
source: Winning ticket detected
si: ජයග්‍රාහී ටිකට් පතක් හමු විය
ta: வெற்றி டிக்கெட் கண்டறியப்பட்டது

# seedWinMessage
source: Your Mega Power ticket won a prize. Tap for details.
si: ඔබගේ මෙගා පවර් ටිකට් පතට ත්‍යාගයක් ලැබී ඇත. විස්තර සඳහා තට්ටු කරන්න.
ta: உங்கள் Mega Power டிக்கெட் பரிசு வென்றுள்ளது. விவரங்களுக்கு தட்டவும்.

# seedScanTitle
source: Scan completed
si: ස්කෑන් කිරීම සම්පූර්ණයි
ta: ஸ்கேன் முடிந்தது

# seedScanMessage
source: We extracted your ticket numbers. Review them before checking.
si: අපි ඔබගේ ටිකට් අංක උපුටා ගත්තා. පරීක්ෂා කිරීමට පෙර ඒවා සමාලෝචනය කරන්න.
ta: உங்கள் டிக்கெட் எண்களை எடுத்தோம். சரிபார்ப்பதற்கு முன் அவற்றைப் பார்வையிடவும்.

# lotteryAdaKotipathi
source: Ada Kotipathi
si: අද කෝටිපති

# lotterySuperBall
source: Super Ball
si: සුපර් බෝල්

# lotteryLagnaWasana
source: Lagna Wasana
si: ලග්න වාසනා
